code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаСПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаСПД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоMX</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоMX</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПоручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперацииД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПОМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособХранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИЦ_ОстатокНаНачалоДня</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Д_ОстатокДоОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИЦ_ОстатокНаКонецДня</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Д_ОстатокПослеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОПолучатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СпособыХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыХранения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрытый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маркированный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/иц_СводноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>иц_СводноеПоручение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияОтчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПоручения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОперацииД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПОМХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособХранения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИЦ_ОстатокНаНачалоДня</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Д_ОстатокДоОперации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИЦ_ОстатокНаКонецДня</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Д_ОстатокПослеОперации</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХраненияПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДепоМХПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделСчетаДЕПОПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПОМХПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ЗагрузкаСПД/Ext/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить область
//
// Считывает данные из Табличного документа и заполняет ТЧ обработки и некоторые реквизиты обработки
//
// Параметры:
//  ТабличныйДокумент	 - ТабличныйДокумент - Табличный документ из формы обработки
//
Процедура ЗаполнитьОбласть(ТабличныйДокумент) Экспорт
	
	СоставПоручения.Очистить();
	
	ТекСтрока = 19;
	СпособХранения = Перечисления.СпособыХранения.Открытый;
	ПерваяИтерация = Истина;
	Пока ТекСтрока <= ТабличныйДокумент.ВысотаТаблицы Цикл
		
		ПерваяКолонка = ТабличныйДокумент.Область("R" + ТекСтрока + "C1").Текст;
		Если ПерваяКолонка = "" Тогда
			Прервать;
		КонецЕсли;
		
		ВидОперацииСтрокой = ТабличныйДокумент.Область("R" + ТекСтрока + "C1").Текст;
		Количество = Число(СтрЗаменить(ТабличныйДокумент.Область("R" + ТекСтрока + "C10").Текст, ",", ""));
		
		Если СтрНайти(НРег(ВидОперацииСтрокой), "зачисление") > 0 Тогда
			ВидОперации = Справочники.ВидыОпераций.Депонирование;
		Иначе
			ВидОперации = Справочники.ВидыОпераций.СнятиеСДепонирования;
		КонецЕсли;
		
		Если ПерваяИтерация Тогда
			СтрокаРазделСчетаДепо = ТабличныйДокумент.Область("R" + ТекСтрока + "C5").Текст;
			ЗаполнитьОсновныеРеквизиты(СтрокаРазделСчетаДепо);
			
			ПроверитьЗаполнениеРеквизитов();
			
			ПерваяИтерация = Ложь;
		КонецЕсли;
		
		СтрокаISIN = СокрЛП(ТабличныйДокумент.Область("R" + ТекСтрока + "C8").Текст);
		ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(СтрокаISIN, Неопределено);
		Если ЦеннаяБумага = Неопределено Тогда
			СтрокаГосНомер = СокрЛП(ТабличныйДокумент.Область("R" + ТекСтрока + "C9").Текст);
			ЦеннаяБумага = ПолучитьЦБПоГосНомеру(СтрокаГосНомер);
		КонецЕсли;
		
		СтрокаТЧ = СоставПоручения.Добавить();
		СтрокаТЧ.СчетДЕПОМХ = СчетДепоMX;
		СтрокаТЧ.РазделСчетаДЕПОМХ = РазделСчетаДепоMX;
		СтрокаТЧ.МестоХранения = МестоХранения;
		СтрокаТЧ.ЦеннаяБумага = ЦеннаяБумага;
		СтрокаТЧ.СчетДЕПО = СчетДепо;
		СтрокаТЧ.СпособХранения = СпособХранения;
		СтрокаТЧ.РазделСчетаДЕПО = РазделСчетаДепо;
		СтрокаТЧ.Депонент = Депонент;
		СтрокаТЧ.ВидОперацииД = ВидОперации;
		СтрокаТЧ.Количество = Количество;
		
		ТекСтрока = ТекСтрока + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Прочитать на сервере
// 
// Считывает файл, заполняет табличный документ обработки, заполняет некоторые основные реквизиты
//
// Параметры:
//  Адрес				 - Строка - Полный путь к файлу xls
//  ТабличныйДокумент	 - ТабличныйДокумент - Табличный документ из формы обработки
//
Процедура ПрочитатьНаСервере(Адрес, ТабличныйДокумент) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	ПериодСтрока = ТабличныйДокумент.Область("R15C8").Текст;
	ПериодНачало = СтрокуВДату(ПериодСтрока);
	ПериодКонец = КонецДня(ПериодНачало);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'ЗагрузкаСПД'"),
			УровеньЖурналаРегистрации.Ошибка, , , "Не удалось удалить временный файл. " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

// Функция - Новый документ
// Создает новый документ иц_СводноеПоручение и заполняет на основе реквизитов обработки
// 
// Возвращаемое значение:
//   - ДокументСсылка.иц_СводноеПоручение
//
Функция НовыйДокумент() Экспорт
	
	Документ = Документы.иц_СводноеПоручение.СоздатьДокумент();
	
	ЗаполнитьДокументОбъект(Документ);
	Документ.Записать(РежимЗаписиДокумента.Проведение);
	Возврат Документ.Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокуВДату(СтрокаДата)
	Массив = СтрРазделить(СтрокаДата, ".");
	Возврат Дата(Массив[2], Массив[1], Массив[0]);
КонецФункции

Функция ПолучитьЦБПоГосНомеру(ГосНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЦенныеБумаги.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.НомерРегистрации = &ГосНомер";
	
	Запрос.УстановитьПараметр("ГосНомер", ГосНомер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитов()
	
	Если Не ЗначениеЗаполнено(РазделСчетаДепо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел счета депо не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетДепо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет депо не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Депонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Депонент не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РазделСчетаДепоMX) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Раздел счета депо МХ не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СчетДепоMX) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Счет депо МХ не заполнен.");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МестоХранения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Место хранения не заполнено.");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументОбъект(Документ)
	СекундДляРовнойМинуты = 59;
	Документ.Дата = ПериодКонец - СекундДляРовнойМинуты;
	
	Документ.ДатаИсполнения = КонецДня(ПериодКонец);
	Документ.ДатаФормированияОтчетов = ПериодКонец;
	
	Документ.НачалоПериода = ПериодНачало;
	Документ.ОкончаниеПериода = КонецДня(ПериодКонец);
	
	Документ.СоставПоручения.Загрузить(СоставПоручения.Выгрузить());
	Документ.СоставПоручения.Сортировать("ВидОперацииД");
	Если Документ.СоставПоручения.Количество() > 0 Тогда
		Документ.СчетДЕПО = СчетДепо;
	КонецЕсли;
	Документ.Инициатор = Инициатор;
	
	
КонецПроцедуры

Процедура ЗаполнитьОсновныеРеквизиты(КодРазделаСчетаДепо)
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РазделыСчетаДепо.Ссылка КАК РазделСчетаДепо,
	|	РазделыСчетаДепо.Владелец КАК СчетДепо,
	|	РазделыСчетаДепо.Владелец.Владелец КАК Депонент,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ КАК РазделСчетаДепоMX,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец КАК СчетДепоMX,
	|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец.Владелец КАК МестоХранения
	|ИЗ
	|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|ГДЕ
	|	РазделыСчетаДепо.Код = &КодРазделаСчетаДепо";
	
	Запрос.УстановитьПараметр("КодРазделаСчетаДепо", КодРазделаСчетаДепо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РазделСчетаДепо = Выборка.РазделСчетаДепо;
		СчетДепо = Выборка.СчетДепо;
		Депонент = Выборка.Депонент;
		РазделСчетаДепоMX = Выборка.РазделСчетаДепоMX;
		СчетДепоMX = Выборка.СчетДепоMX;
		МестоХранения = Выборка.МестоХранения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
